app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `updated_at`, `login`, `password`, `email`, `created_at`) VALUES('ashish', '2009-10-02 07:53:17', 'ashish', '7b69ad8a8999d4ca7c42b8a729fb0ffd', 'aashish.kiran@gmail.com', '2009-10-02 07:53:17')

  def check_for_unique_login
      p  params
      p   "@user"
      @user = User.find(:first, :conditions => "login = '#{params[:login]}'")
---
SELECT * FROM `users` WHERE (login = '') LIMIT 1